src/InformationRegisters/Scan_СрокиВыполненияКонтроляТехническогоCостояния/Scan_СрокиВыполненияКонтроляТехническогоCостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_СрокиВыполненияКонтроляТехническогоCостояния</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СрокКТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПакетСервисныхОпераций</name>
    <type>
      <types>CatalogRef.Scan_ПакетыСервисныхОпераций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛогистическийТип</name>
    <type>
      <types>CatalogRef.Scan_ТипыПродуктовЛогистика</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_СрокиВыполненияКонтроляТехническогоCостояния/ManagerModule.bsl
//rarus tenkam 06.11.2017 mantis 9427 ++
Процедура ЗаписатьСрокиВыполненияКТСВРегистр(ПакетСервисныхОпераций, ЛогистическийТип, СрокКТС, НаДату = Неопределено) Экспорт
	Если НаДату = Неопределено Тогда
		ДатаЗаписи = ТекущаяДата();
	Иначе
		ДатаЗаписи = НаДату;
	КонецЕсли; 
	//Чтение старого значения регистра
	СтруктураОтбора   = Новый Структура("ПакетСервисныхОпераций,ЛогистическийТип", ПакетСервисныхОпераций, ЛогистическийТип);
	СтруктураСведений = РегистрыСведений.Scan_СрокиВыполненияКонтроляТехническогоCостояния.ПолучитьПоследнее(ДатаЗаписи, СтруктураОтбора);
	СтарыйСрокКТС     = СтруктураСведений.СрокКТС;
	Записывать        = Ложь;
	//Введено значение, а старое отсутствует
	Если ЗначениеЗаполнено(СрокКТС) И СтарыйСрокКТС = 0 Тогда 
		Записывать = Истина; 
	КонецЕсли; 
	//Значение стерто, а старое значение было введено
	Если НЕ ЗначениеЗаполнено(СрокКТС) И СтарыйСрокКТС <> 0 Тогда 
		Записывать = Истина; 
	КонецЕсли; 
	//Введено значение и было введено старое
	Если ЗначениеЗаполнено(СрокКТС) И СтарыйСрокКТС <> 0 Тогда
		//Значение изменилось
		Если СрокКТС <> СтарыйСрокКТС Тогда 
			Записывать = Истина; 
		КонецЕсли; 
	КонецЕсли; 
	Если Записывать Тогда
		//Значение параметра изменилось
		ЗаписьРегСведений = РегистрыСведений.Scan_СрокиВыполненияКонтроляТехническогоCостояния.СоздатьМенеджерЗаписи();
		ЗаписьРегСведений.ПакетСервисныхОпераций		= ПакетСервисныхОпераций;
		ЗаписьРегСведений.ЛогистическийТип				= ЛогистическийТип;
		ЗаписьРегСведений.СрокКТС						= СрокКТС;
		ЗаписьРегСведений.Период						= ДатаЗаписи;
		ЗаписьРегСведений.Пользователь					= ПользователиКлиентСервер.ТекущийПользователь();
		
		Попытка
			ЗаписьРегСведений.Записать();
		Исключение
			//rarus FominskiyAS 08.07.2019  mantis 14191 +++
			//Сообщить(НСтр("ru = 'Ошибка записи срока выполнения КТС в регистр сведений'"));
			Сообщить(НСтр("ru = 'Ошибка записи срока выполнения КТС в регистр сведений'; en = 'Action failed'"));
			//rarus FominskiyAS 08.07.2019  mantis 14191 ---  
		КонецПопытки; 
	КонецЕсли;  	
	
КонецПроцедуры

Процедура ОчиститьЗаписиНедействительногоПакета(ПакетСервисныхОпераций) Экспорт
	    	
	НаборЗаписей = РегистрыСведений.Scan_СрокиВыполненияКонтроляТехническогоCостояния.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПакетСервисныхОпераций.Установить(ПакетСервисныхОпераций);
	Попытка
		НаборЗаписей.Записать();
		
	Исключение
		//rarus FominskiyAS 08.07.2019  mantis 14191 +++
		//Сообщить(НСтр("ru = 'Ошибка записи срока выполнения КТС в регистр сведений'"));
		Сообщить(НСтр("ru = 'Ошибка записи срока выполнения КТС в регистр сведений'; en = 'Action failed'"));
		//rarus FominskiyAS 08.07.2019  mantis 14191 ---  
	КонецПопытки; 

КонецПроцедуры

//rarus tenkam 06.11.2017 mantis 9427 --
